use newsdb;
db.news.aggregate(
    [
        {
            $match: {
                $or:
                [
                    {summary: {$regex: 'Covid-19|کروناویروس|کرونا|کووید ۱۹|کویید ۱۹|سویه جدید'}},
                    {title: {$regex: 'Covid-19|کروناویروس|کرونا|کووید ۱۹|کویید ۱۹|سویه جدید'}},
                    {text: {$regex: 'Covid-19|کروناویروس|کرونا|کووید ۱۹|کویید ۱۹|سویه جدید'}},
                    {tags: {$in: ['/Covid-19/', '/کرونا/', '/کروناویروس/', '/کویید ۱۹/', '/کووید ۱۹/', '/سویه جدید/']}}
                ]
            }
        },
        {
            $count: "count"
        }
    ]
);
